import random

from old import word


def help():
    print("""
    Все ваши действия вы должны подтверждать нажатием кнопки 'ENTER'
    Вы вводите букву, которая на ваш взгляд есть у слове,
    и нажимаете 'ENTER', всю осталюную информацию будут показывать подсказки
    (я это написал из за того, что в эту игру не смог сразу же поиграть гуманитарий)
    """)

def words():
    lis = word.lis
    return random.choice(lis)

#будет показывать когда вы проиграли
you_lose = {

    1:    "    #############",
    2:    "        |       #",
    3:    "        O       #",
    4:    "       /|\    / #",
    5:    "       / \   /  #",
    6:    "            /   #",
    7:    "    #############"

}
#покажет что вы выграли вы выграли
you_win = (
"""
           ##############
                 |      #
                 O      #
            \O/       / #
             |       /  #
            / \     /   #
           ##############
"""
)

ABC_RU = ["А", "Б", "В", "Г", "Д", "Е", "Ё", "Й", "К", "Л", "М",
               "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ю", "Я", "Ч", "Ь", "Ш", "Щ", "З", "Ъ", "Ы", "Ж", "Э", "И"]

ABC = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K",
               "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"]

menu = print("""
#######################################################################
                           НАЧАТЬ ИГРУ = 1   
                            КАК ИГРАТЬ = 2
                              БОТ = 3
###############     выйти с игры = любая другая команда    ############
#######################################################################
"""
    )

cost_letters = {
    "А":	1, "К":	 2, "Ф":	8,  "Ю":	8,
    "Б":	3, "Л":	 2, "Х":	5,  "Я":	3,
    "В":	1, "М":	 2, "Ц":	5,
    "Г":	3, "Н":	 1, "Ч":	5,
    "Д":	2, "О":	 1, "Ш":	8,
    "Е":	1, "П":	 2, "Щ":	10,
    "Ж":	5, "Р":	 5, "Ъ":	15,
    "З":	5, "С":	 5, "Ы":	4,
    "И":	1, "Т":	 5, "Ь":	3,
    "Й":	3, "У":	 4, "Э":	8,
}

def bot():
    return random.choice(ABC_RU)